#1. Да се състави програма, чрез която се въвежда 4-цифренo естествено 
#число от интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа.
 #Първото число се формира от 1-та и 4-та цифра на въведеното число. 
 #Второто число се формира от 2-рa - 3-та цифра на въведеното число. 
 #На екрана да се изведе дали 1-то ново число e по-малко <, равно = или 
 #по-голямо от 2-то число.
#Използвайте проверка на логическо условие - оператор if.

try:
    num = input('Write number between 1000 and 9999: ')
    num1 = num[0] + num[3]
    num2 = num[1] + num[2]
    if num1 < num2:
        print(num1, 'is less than', num2)
    elif num1 > num2:
         print(num2, 'is bigger than', num1)
    else:
         print(num1, 'is equal to', num2)
    

except:
     print('Write correct number')