#6. Преди доста години имаше услуга - изпращане на луксозна телеграма. Поводи най-различни: рожден, имен ден, сватба и т.н. 
#Цената се формираше по следния начин А: цена за бланка, B: цена за текст до 20 думи, C: цена за всяка дума, след първите 20 думи. 
#Стойностите на A, B, C са реални числа от интервала [0.02..0.89]. 
#Да се състави програма, чрез която по въведени брой думи, стойности за A, B, брой думи, C се изчислява крайна цена на луксозна телеграма.

a = 0.02
b = 0.20
c = 0.01
num_words = 30
price = a + b + (30 - 20) * 0.01
print('The price of your telegram is:', price)
