'''Задача 2. При анализиране на данни, събрани като част от научен експеримент, може
да се наложи да се премахнат най-крайните (големите) стойности, преди да се
извършват някакви други изчисления. Да се създаде списък от стойностите само с n на
брой положителни числа. Трябва да се създаде ново копие на създаденият списък с
премахнатите n най-големи елемента и n най-малките елементи. Редът на елементите
във върнатия списък не трябва да съвпада с реда на елементите в първоначалния
списък. Напишете програма, която да чете списък от числа въведени от потребителя и
да премахва двете най-големи и двете най-малки стойности. Да се принтира новият
списък, както и оригиналният. Програма трябва да генерира подходящо съобщение за
грешка, ако потребителят въведе по-малко от 4 стойности.'''
#define how many numbers
n = int(input('Enter a number: '))
#n has to be positive and > 4
if n <= 4:
    print("Numbers has to be positive and >4. Try again.")
    exit()
#create list
lst = []
for i in range(n):
    num = int(input('Write a number and press enter: '))
    lst.append(num)
lst.sort()
print('Original list: ',lst)
lst_copy = lst.copy()
print('New list: ',lst_copy)
del lst[:2]
del lst[-2:]
print(lst_copy)

