'''Задача 9. Напишете програма, която създава следните квадратни матрици и ги
извежда на конзолата във форматиран вид. Размерът на матриците се въвежда от
конзолата. Пример за (4,4):'''


for i,j,m,l in zip(range(1,6), range(8,4,-1),range(9,14), range(16,12, -1)):

    print(f'{i}\t{j}\t{m}\t{l}')